Repository: BornSupercharged/OllamaManagerUI
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: fr

source: Initialized OllamaClient with base URL: %s
fr: OllamaClient initialisé avec l'URL de base: %s

source: Unable to connect to Ollama server
fr: Impossible de se connecter au serveur Ollama

source: Connection to Ollama server timed out
fr: Le délai de connexion au serveur Ollama a expiré

source: Ollama server is not running
fr: Le serveur Ollama n'est pas en cours d'exécution

source: Server error: %s
fr: Erreur serveur: %s

source: Creating model with file: %s
fr: Création d'un modèle avec fichier: %s

source: Configuration for %s saved successfully
fr: Configuration du modèle %s mise à jour avec succès

source: Server check failed with error: %s
fr: La vérification du serveur a échoué avec l'erreur: %s

source: The model %s is not running
fr: Le modèle %s n'est pas en cours d'exécution

source: The model %s has been stopped successfully
fr: Le modèle %s a été arrêté avec succès

source: Unable to stop model %s
fr: Impossible d'arrêter le modèle %s

source: The model %s was successfully deleted
fr: Le modèle %s a été supprimé avec succès

source: Failed to change language
fr: Échec du changement de langue

source: Are you sure you want to stop the model
fr: Êtes-vous sûr de vouloir arrêter le modèle

source: Failed to stop the model
fr: Échec de l'arrêt du modèle

source: Success
fr: Succès

source: Model
fr: Modèle

source: stopped successfully
fr: arrêté avec succès

source: Error
fr: Erreur

source: HTTP Error Status
fr: Erreur HTTP Statut

source: Operation(s)
fr: Opération(s)

source: Total Operations
fr: Opérations Totales

source: Total Prompt Tokens
fr: Tokens de Prompt

source: Total Complete Tokens
fr: Tokens de Complétion

source: Total Duration
fr: Durée Totale

source: Operations by Type
fr: Opérations par Type

source: Are you sure you want to delete this model?
fr: Êtes-vous sûr de vouloir supprimer le modèle?

source: Failed to delete the model
fr: Échec de la suppression du modèle

source: successfully deleted
fr: supprimé avec succès

source: No models found
fr: Aucun modèle trouvé

source: Please enter a model name
fr: Veuillez entrer un nom de modèle

source: Starting the download...
fr: Démarrage du téléchargement...

source: Download complete
fr: Téléchargement terminé

source: Error downloading
fr: Erreur de téléchargement

source: Failed to download the model
fr: Échec du téléchargement du modèle

source: Download progress
fr: Téléchargement en cours

source: downloaded successfully
fr: téléchargé avec succès

source: Date unknown
fr: Date inconnue

source: Ollama server not connected
fr: Serveur Ollama non connecté

source: Unable to retrieve models
fr: Impossible de récupérer les modèles

source: Delete
fr: Supprimer

source: No Models Installed
fr: Aucun Modèle Installé

source: Unable to retrieve running models
fr: Impossible de récupérer les modèles en cours d'exécution

source: Stop
fr: Arrêter

source: No Models Running
fr: Aucun Modèle en cours d'Exécution

source: Failed to fetch stats
fr: Échec de la récupération des statistiques

source: Total Completion Tokens
fr: Tokens de Complétion

source: Please select at least two models to compare
fr: Veuillez sélectionner au moins deux modèles à comparer

source: Loading details...
fr: Chargement des détails...

source: Error loading details
fr: Erreur lors du chargement des détails

source: Please select at least one model
fr: Veuillez sélectionner au moins un modèle

source: Are you sure you want to delete
fr: Êtes-vous sûr de vouloir supprimer

source: model(s)
fr: modèle(s)

source: Created on
fr: Créé le

source: Parameter Name
fr: Nom du paramètre

source: Value
fr: Valeur

source: No models selected
fr: Aucun modèle sélectionné

source: Failed to save the configuration
fr: Échec de la sauvegarde de la configuration

source: Model configuration
fr: Configuration du modèle

source: saved successfully
fr: sauvegardée avec succès

source: Ollama Model Manager
fr: Gestionnaire de Modèles Ollama

source: Ollama Manager
fr: Gestionnaire Ollama

source: Search for a new model to download
fr: Télécharger un Nouveau Modèle

source: Enter the model name (ex: llama2:7b)
fr: Entrez le nom du modèle (ex: llama2:7b)

source: Pull Down
fr: Télécharger

source: Tools
fr: Outils

source: Overall Usage Statistics
fr: Statistiques d'Utilisation Globales

source: Global Usage Statistics
fr: Statistiques Globales d'Utilisation

source: Statistics will populate here
fr: Les statistiques s'afficheront ici

source: Local Models
fr: Modèles Locaux

source: Delete Selected
fr: Supprimer la Sélection

source: Configure Selected
fr: Configurer la Sélection

source: Compare Selected
fr: Comparer la Sélection

source: Select All
fr: Tout Sélectionner

source: Toggle All Models
fr: Basculer tous les Modèles

source: Model Name
fr: Nom du Modèle

source: Date Modified
fr: Date de Modification

source: Size
fr: Taille

source: Family
fr: Famille

source: Parameters
fr: Paramètres

source: Running Models
fr: Modèles en Cours d'Exécution

source: Refresh
fr: Actualiser

source: Model Comparison
fr: Comparaison de Modèles

source: Close
fr: Fermer

source: Batch Operation Results
fr: Résultats des Opérations par lots

source: Model Configuration
fr: Configuration du Modèles

source: System Prompt
fr: Invite Système

source: Template
fr: Modèle

source: Add Parameter
fr: Add Paramètres

source: Cancel
fr: Annuler

source: Save
fr: Enregistrer

source: Settings
fr: Paramètres

source: Ollama Server URL
fr: URL du Serveur Ollama

source: Interface Theme
fr: Thème de l'interface

source: Model Statistics
fr: Statistiques du Modèle
